ananawaretrk/Opal_Fcc_nrf52810/rfm95/RH_RF95.h
    int16_t lastRssi();

    bool waitPacketSent();

    bool checkPacketSent();

    bool waitCAD();
    
    uint8_t mode();
    void setMode(RHMode mode);
    uint16_t rxBad();
    uint16_t rxGood();
    uint16_t txGood();
    void setCADTimeout(unsigned long cad_timeout);

    uint8_t             _thisAddress;
    
    /// Whether the transport is in promiscuous mode
    bool                _promiscuous;

    /// TO header in the last received mesasge
    volatile uint8_t    _rxHeaderTo;

    /// FROM header in the last received mesasge
    volatile uint8_t    _rxHeaderFrom;

    /// ID header in the last received mesasge
    volatile uint8_t    _rxHeaderId;

    /// FLAGS header in the last received mesasge
    volatile uint8_t    _rxHeaderFlags;

    /// TO header to send in all messages
    uint8_t             _txHeaderTo;

    /// FROM header to send in all messages
    uint8_t             _txHeaderFrom;

    /// ID header to send in all messages
    uint8_t             _txHeaderId;

    /// FLAGS header to send in all messages
    uint8_t             _txHeaderFlags;


    /// This is a low level function to handle the interrupts for one instance of RH_RF95.
    /// Called automatically by isr*()
    /// Should not need to be called by user code.
    void           handleInterrupt();
    
    const nrf_drv_spi_t *_spi;

    uint8_t get_irq_flag();
    uint8_t reverse(uint8_t b);
    uint8_t get_Mode();
    uint8_t modem_Stat();
protected:
    /// Examine the revceive buffer to determine whether the message is for this node
    void validateRxBuf();

    /// Clear our local receive buffer
    void clearRxBuf();
    /// Count of the number of bad messages (eg bad checksum etc) received
    volatile uint16_t   _rxBad;

    /// Count of the number of successfully transmitted messaged
    volatile uint16_t   _rxGood;

    /// Count of the number of bad messages (correct checksum etc) received
    volatile uint16_t   _txGood;
    
    /// Channel activity detected
    volatile bool       _cad;

    /// Channel activity timeout in ms
    unsigned int        _cad_timeout;

     /// Array of instances connected to interrupts 0 and 1
    /// The current transport operating mode
    volatile RHMode     _mode;
private:
    //static RH_RF95*     _deviceForInterrupt[];

    /// Index of next interrupt number to use in _deviceForInterrupt
    //static uint8_t      _interruptCount;

    /// The configured interrupt pin connected to this instance
    nrf_drv_spi_t*         spi;
    uint32_t             _interruptPin;

    /// The index into _deviceForInterrupt[] for this device (if an interrupt is already allocated)
    /// else 0xff
    //uint8_t             _myInterruptIndex;

    /// Number of octets in the buffer
    volatile uint8_t    _bufLen;
    
    /// The receiver/transmitter buffer
    uint8_t             _buf[RH_RF95_MAX_PAYLOAD_LEN];

    /// True when there is a valid message in the buffer
    volatile bool       _rxBufValid;

    // True if we are using the HF port (779.0 MHz and above)
    bool                _usingHFport;

    // Last measured SNR, dB
    int16_t              _lastSNR;    
    int16_t              _lastRssi;


};

/// @example rf95_client.pde
/// @example rf95_server.pde
/// @example rf95_encrypted_client.pde
/// @example rf95_encrypted_server.pde
/// @example rf95_reliable_datagram_client.pde
/// @example rf95_reliable_datagram_server.pde

#endif

